zephyrproject-rtos/hal_atmel/asf/sam/include/sam4l/component/ast.h
/**
 * \file
 *
 * \brief Component description for AST
 *
 * Copyright (c) 2016 Atmel Corporation,
 *                    a wholly owned subsidiary of Microchip Technology Inc.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the Licence at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 * \asf_license_stop
 *
 */

#ifndef _SAM4L_AST_COMPONENT_
#define _SAM4L_AST_COMPONENT_

/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR AST */
/* ========================================================================== */
/** \addtogroup SAM4L_AST Asynchronous Timer */
/*@{*/

#define AST_I7532
#define REV_AST                     0x311

/* -------- AST_CR : (AST Offset: 0x00) (R/W 32) Control Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t EN:1;             /*!< bit:      0  Enable                             */
    uint32_t PCLR:1;           /*!< bit:      1  Prescaler Clear                    */
    uint32_t CAL:1;            /*!< bit:      2  Calendar mode                      */
    uint32_t :5;               /*!< bit:  3.. 7  Reserved                           */
    uint32_t CA0:1;            /*!< bit:      8  Clear on Alarm 0                   */
    uint32_t CA1:1;            /*!< bit:      9  Clear on Alarm 1                   */
    uint32_t :6;               /*!< bit: 10..15  Reserved                           */
    uint32_t PSEL:5;           /*!< bit: 16..20  Prescaler Select                   */
    uint32_t :11;              /*!< bit: 21..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} AST_CR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AST_CR_OFFSET               0x00         /**< \brief (AST_CR offset) Control Register */
#define AST_CR_RESETVALUE           _U_(0x00000000); /**< \brief (AST_CR reset_value) Control Register */

#define AST_CR_EN_Pos               0            /**< \brief (AST_CR) Enable */
#define AST_CR_EN                   (_U_(0x1) << AST_CR_EN_Pos)
#define   AST_CR_EN_0_Val                 _U_(0x0)   /**< \brief (AST_CR) The AST is disabled. */
#define   AST_CR_EN_1_Val                 _U_(0x1)   /**< \brief (AST_CR) The AST is enabled */
#define AST_CR_EN_0                 (AST_CR_EN_0_Val               << AST_CR_EN_Pos)
#define AST_CR_EN_1                 (AST_CR_EN_1_Val               << AST_CR_EN_Pos)
#define AST_CR_PCLR_Pos             1            /**< \brief (AST_CR) Prescaler Clear */
#define AST_CR_PCLR                 (_U_(0x1) << AST_CR_PCLR_Pos)
#define AST_CR_CAL_Pos              2            /**< \brief (AST_CR) Calendar mode */
#define AST_CR_CAL                  (_U_(0x1) << AST_CR_CAL_Pos)
#define AST_CR_CA0_Pos              8            /**< \brief (AST_CR) Clear on Alarm 0 */
#define AST_CR_CA0                  (_U_(0x1) << AST_CR_CA0_Pos)
#define AST_CR_CA1_Pos              9            /**< \brief (AST_CR) Clear on Alarm 1 */
#define AST_CR_CA1                  (_U_(0x1) << AST_CR_CA1_Pos)
#define AST_CR_PSEL_Pos             16           /**< \brief (AST_CR) Prescaler Select */
#define AST_CR_PSEL_Msk             (_U_(0x1F) << AST_CR_PSEL_Pos)
#define AST_CR_PSEL(value)          (AST_CR_PSEL_Msk & ((value) << AST_CR_PSEL_Pos))
#define AST_CR_MASK                 _U_(0x001F0307) /**< \brief (AST_CR) MASK Register */

/* -------- AST_CV : (AST Offset: 0x04) (R/W 32) Counter Value -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t VALUE:32;         /*!< bit:  0..31  AST Value                          */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} AST_CV_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AST_CV_OFFSET               0x04         /**< \brief (AST_CV offset) Counter Value */
#define AST_CV_RESETVALUE           _U_(0x00000000); /**< \brief (AST_CV reset_value) Counter Value */

#define AST_CV_VALUE_Pos            0            /**< \brief (AST_CV) AST Value */
#define AST_CV_VALUE_Msk            (_U_(0xFFFFFFFF) << AST_CV_VALUE_Pos)
#define AST_CV_VALUE(value)         (AST_CV_VALUE_Msk & ((value) << AST_CV_VALUE_Pos))
#define AST_CV_MASK                 _U_(0xFFFFFFFF) /**< \brief (AST_CV) MASK Register */

/* -------- AST_SR : (AST Offset: 0x08) (R/  32) Status Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t OVF:1;            /*!< bit:      0  Overflow                           */
    uint32_t :7;               /*!< bit:  1.. 7  Reserved                           */
    uint32_t ALARM0:1;         /*!< bit:      8  Alarm 0                            */
    uint32_t ALARM1:1;         /*!< bit:      9  Alarm 1                            */
    uint32_t :6;               /*!< bit: 10..15  Reserved                           */
    uint32_t PER0:1;           /*!< bit:     16  Periodic 0                         */
    uint32_t PER1:1;           /*!< bit:     17  Periodic 1                         */
    uint32_t :6;               /*!< bit: 18..23  Reserved                           */
    uint32_t BUSY:1;           /*!< bit:     24  AST Busy                           */
    uint32_t READY:1;          /*!< bit:     25  AST Ready                          */
    uint32_t :2;               /*!< bit: 26..27  Reserved                           */
    uint32_t CLKBUSY:1;        /*!< bit:     28  Clock Busy                         */
    uint32_t CLKRDY:1;         /*!< bit:     29  Clock Ready                        */
    uint32_t :2;               /*!< bit: 30..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} AST_SR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AST_SR_OFFSET               0x08         /**< \brief (AST_SR offset) Status Register */
#define AST_SR_RESETVALUE           _U_(0x00000000); /**< \brief (AST_SR reset_value) Status Register */

#define AST_SR_OVF_Pos              0            /**< \brief (AST_SR) Overflow */
#define AST_SR_OVF                  (_U_(0x1) << AST_SR_OVF_Pos)
#define AST_SR_ALARM0_Pos           8            /**< \brief (AST_SR) Alarm 0 */
#define AST_SR_ALARM0               (_U_(0x1) << AST_SR_ALARM0_Pos)
#define AST_SR_ALARM1_Pos           9            /**< \brief (AST_SR) Alarm 1 */
#define AST_SR_ALARM1               (_U_(0x1) << AST_SR_ALARM1_Pos)
#define AST_SR_PER0_Pos             16           /**< \brief (AST_SR) Periodic 0 */
#define AST_SR_PER0                 (_U_(0x1) << AST_SR_PER0_Pos)
#define AST_SR_PER1_Pos             17           /**< \brief (AST_SR) Periodic 1 */
#define AST_SR_PER1                 (_U_(0x1) << AST_SR_PER1_Pos)
#define AST_SR_BUSY_Pos             24           /**< \brief (AST_SR) AST Busy */
#define AST_SR_BUSY                 (_U_(0x1) << AST_SR_BUSY_Pos)
#define   AST_SR_BUSY_0_Val               _U_(0x0)   /**< \brief (AST_SR) The AST accepts writes to CV, WER, DTR, SCR, AR, PIR and CR */
#define   AST_SR_BUSY_1_Val               _U_(0x1)   /**< \brief (AST_SR) The AST is busy and will discard writes to CV, WER, DTR, SCR, AR, PIR and CR */
#define AST_SR_BUSY_0               (AST_SR_BUSY_0_Val             << AST_SR_BUSY_Pos)
#define AST_SR_BUSY_1               (AST_SR_BUSY_1_Val             << AST_SR_BUSY_Pos)
#define AST_SR_READY_Pos            25           /**< \brief (AST_SR) AST Ready */
#define AST_SR_READY                (_U_(0x1) << AST_SR_READY_Pos)
#define AST_SR_CLKBUSY_Pos          28           /**< \brief (AST_SR) Clock Busy */
#define AST_SR_CLKBUSY              (_U_(0x1) << AST_SR_CLKBUSY_Pos)
#define   AST_SR_CLKBUSY_0_Val            _U_(0x0)   /**< \brief (AST_SR) The clock is ready and can be changed */
#define   AST_SR_CLKBUSY_1_Val            _U_(0x1)   /**< \brief (AST_SR) CEN has been written and the clock is busy */
#define AST_SR_CLKBUSY_0            (AST_SR_CLKBUSY_0_Val          << AST_SR_CLKBUSY_Pos)
#define AST_SR_CLKBUSY_1            (AST_SR_CLKBUSY_1_Val          << AST_SR_CLKBUSY_Pos)
#define AST_SR_CLKRDY_Pos           29           /**< \brief (AST_SR) Clock Ready */
#define AST_SR_CLKRDY               (_U_(0x1) << AST_SR_CLKRDY_Pos)
#define AST_SR_MASK                 _U_(0x33030301) /**< \brief (AST_SR) MASK Register */

/* -------- AST_SCR : (AST Offset: 0x0C) ( /W 32) Status Clear Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t OVF:1;            /*!< bit:      0  Overflow                           */
    uint32_t :7;               /*!< bit:  1.. 7  Reserved                           */
    uint32_t ALARM0:1;         /*!< bit:      8  Alarm 0                            */
    uint32_t ALARM1:1;         /*!< bit:      9  Alarm 1                            */
    uint32_t :6;               /*!< bit: 10..15  Reserved                           */
    uint32_t PER0:1;           /*!< bit:     16  Periodic 0                         */
    uint32_t PER1:1;           /*!< bit:     17  Periodic 1                         */
    uint32_t :7;               /*!< bit: 18..24  Reserved                           */
    uint32_t READY:1;          /*!< bit:     25  AST Ready                          */
    uint32_t :3;               /*!< bit: 26..28  Reserved                           */
    uint32_t CLKRDY:1;         /*!< bit:     29  Clock Ready                        */
    uint32_t :2;               /*!< bit: 30..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} AST_SCR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

