zephyrproject-rtos/hal_atmel/asf/sam/include/sam4l/component/ast.h
#define AST_CLOCK_CEN_Pos           0            /**< \brief (AST_CLOCK) Clock Enable */
#define AST_CLOCK_CEN               (_U_(0x1) << AST_CLOCK_CEN_Pos)
#define   AST_CLOCK_CEN_0_Val             _U_(0x0)   /**< \brief (AST_CLOCK) The clock is disabled */
#define   AST_CLOCK_CEN_1_Val             _U_(0x1)   /**< \brief (AST_CLOCK) The clock is enabled */
#define AST_CLOCK_CEN_0             (AST_CLOCK_CEN_0_Val           << AST_CLOCK_CEN_Pos)
#define AST_CLOCK_CEN_1             (AST_CLOCK_CEN_1_Val           << AST_CLOCK_CEN_Pos)
#define AST_CLOCK_CSSEL_Pos         8            /**< \brief (AST_CLOCK) Clock Source Selection */
#define AST_CLOCK_CSSEL_Msk         (_U_(0x7) << AST_CLOCK_CSSEL_Pos)
#define AST_CLOCK_CSSEL(value)      (AST_CLOCK_CSSEL_Msk & ((value) << AST_CLOCK_CSSEL_Pos))
#define   AST_CLOCK_CSSEL_SLOWCLOCK_Val   _U_(0x0)   /**< \brief (AST_CLOCK) Slow clock */
#define   AST_CLOCK_CSSEL_32KHZCLK_Val    _U_(0x1)   /**< \brief (AST_CLOCK) 32 kHz clock */
#define   AST_CLOCK_CSSEL_PBCLOCK_Val     _U_(0x2)   /**< \brief (AST_CLOCK) PB clock */
#define   AST_CLOCK_CSSEL_GCLK_Val        _U_(0x3)   /**< \brief (AST_CLOCK) Generic clock */
#define   AST_CLOCK_CSSEL_1KHZCLK_Val     _U_(0x4)   /**< \brief (AST_CLOCK) 1kHz clock from 32 kHz oscillator */
#define AST_CLOCK_CSSEL_SLOWCLOCK   (AST_CLOCK_CSSEL_SLOWCLOCK_Val << AST_CLOCK_CSSEL_Pos)
#define AST_CLOCK_CSSEL_32KHZCLK    (AST_CLOCK_CSSEL_32KHZCLK_Val  << AST_CLOCK_CSSEL_Pos)
#define AST_CLOCK_CSSEL_PBCLOCK     (AST_CLOCK_CSSEL_PBCLOCK_Val   << AST_CLOCK_CSSEL_Pos)
#define AST_CLOCK_CSSEL_GCLK        (AST_CLOCK_CSSEL_GCLK_Val      << AST_CLOCK_CSSEL_Pos)
#define AST_CLOCK_CSSEL_1KHZCLK     (AST_CLOCK_CSSEL_1KHZCLK_Val   << AST_CLOCK_CSSEL_Pos)
#define AST_CLOCK_MASK              _U_(0x00000701) /**< \brief (AST_CLOCK) MASK Register */

/* -------- AST_DTR : (AST Offset: 0x44) (R/W 32) Digital Tuner Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t EXP:5;            /*!< bit:  0.. 4  EXP                                */
    uint32_t ADD:1;            /*!< bit:      5  ADD                                */
    uint32_t :2;               /*!< bit:  6.. 7  Reserved                           */
    uint32_t VALUE:8;          /*!< bit:  8..15  VALUE                              */
    uint32_t :16;              /*!< bit: 16..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} AST_DTR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AST_DTR_OFFSET              0x44         /**< \brief (AST_DTR offset) Digital Tuner Register */
#define AST_DTR_RESETVALUE          _U_(0x00000000); /**< \brief (AST_DTR reset_value) Digital Tuner Register */

#define AST_DTR_EXP_Pos             0            /**< \brief (AST_DTR) EXP */
#define AST_DTR_EXP_Msk             (_U_(0x1F) << AST_DTR_EXP_Pos)
#define AST_DTR_EXP(value)          (AST_DTR_EXP_Msk & ((value) << AST_DTR_EXP_Pos))
#define AST_DTR_ADD_Pos             5            /**< \brief (AST_DTR) ADD */
#define AST_DTR_ADD                 (_U_(0x1) << AST_DTR_ADD_Pos)
#define AST_DTR_VALUE_Pos           8            /**< \brief (AST_DTR) VALUE */
#define AST_DTR_VALUE_Msk           (_U_(0xFF) << AST_DTR_VALUE_Pos)
#define AST_DTR_VALUE(value)        (AST_DTR_VALUE_Msk & ((value) << AST_DTR_VALUE_Pos))
#define AST_DTR_MASK                _U_(0x0000FF3F) /**< \brief (AST_DTR) MASK Register */

/* -------- AST_EVE : (AST Offset: 0x48) ( /W 32) Event Enable Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t OVF:1;            /*!< bit:      0  Overflow                           */
    uint32_t :7;               /*!< bit:  1.. 7  Reserved                           */
    uint32_t ALARM0:1;         /*!< bit:      8  Alarm 0                            */
    uint32_t ALARM1:1;         /*!< bit:      9  Alarm 1                            */
    uint32_t :6;               /*!< bit: 10..15  Reserved                           */
    uint32_t PER0:1;           /*!< bit:     16  Perioidc 0                         */
    uint32_t PER1:1;           /*!< bit:     17  Periodic 1                         */
    uint32_t :14;              /*!< bit: 18..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} AST_EVE_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AST_EVE_OFFSET              0x48         /**< \brief (AST_EVE offset) Event Enable Register */
#define AST_EVE_RESETVALUE          _U_(0x00000000); /**< \brief (AST_EVE reset_value) Event Enable Register */

#define AST_EVE_OVF_Pos             0            /**< \brief (AST_EVE) Overflow */
#define AST_EVE_OVF                 (_U_(0x1) << AST_EVE_OVF_Pos)
#define AST_EVE_ALARM0_Pos          8            /**< \brief (AST_EVE) Alarm 0 */
#define AST_EVE_ALARM0              (_U_(0x1) << AST_EVE_ALARM0_Pos)
#define AST_EVE_ALARM1_Pos          9            /**< \brief (AST_EVE) Alarm 1 */
#define AST_EVE_ALARM1              (_U_(0x1) << AST_EVE_ALARM1_Pos)
#define AST_EVE_PER0_Pos            16           /**< \brief (AST_EVE) Perioidc 0 */
#define AST_EVE_PER0                (_U_(0x1) << AST_EVE_PER0_Pos)
#define AST_EVE_PER1_Pos            17           /**< \brief (AST_EVE) Periodic 1 */
#define AST_EVE_PER1                (_U_(0x1) << AST_EVE_PER1_Pos)
#define AST_EVE_MASK                _U_(0x00030301) /**< \brief (AST_EVE) MASK Register */

/* -------- AST_EVD : (AST Offset: 0x4C) ( /W 32) Event Disable Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t OVF:1;            /*!< bit:      0  Overflow                           */
    uint32_t :7;               /*!< bit:  1.. 7  Reserved                           */
    uint32_t ALARM0:1;         /*!< bit:      8  Alarm 0                            */
    uint32_t ALARM1:1;         /*!< bit:      9  Alarm 1                            */
    uint32_t :6;               /*!< bit: 10..15  Reserved                           */
    uint32_t PER0:1;           /*!< bit:     16  Perioidc 0                         */
    uint32_t PER1:1;           /*!< bit:     17  Periodic 1                         */
    uint32_t :14;              /*!< bit: 18..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} AST_EVD_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AST_EVD_OFFSET              0x4C         /**< \brief (AST_EVD offset) Event Disable Register */
#define AST_EVD_RESETVALUE          _U_(0x00000000); /**< \brief (AST_EVD reset_value) Event Disable Register */

#define AST_EVD_OVF_Pos             0            /**< \brief (AST_EVD) Overflow */
#define AST_EVD_OVF                 (_U_(0x1) << AST_EVD_OVF_Pos)
#define AST_EVD_ALARM0_Pos          8            /**< \brief (AST_EVD) Alarm 0 */
#define AST_EVD_ALARM0              (_U_(0x1) << AST_EVD_ALARM0_Pos)
#define AST_EVD_ALARM1_Pos          9            /**< \brief (AST_EVD) Alarm 1 */
#define AST_EVD_ALARM1              (_U_(0x1) << AST_EVD_ALARM1_Pos)
#define AST_EVD_PER0_Pos            16           /**< \brief (AST_EVD) Perioidc 0 */
#define AST_EVD_PER0                (_U_(0x1) << AST_EVD_PER0_Pos)
#define AST_EVD_PER1_Pos            17           /**< \brief (AST_EVD) Periodic 1 */
#define AST_EVD_PER1                (_U_(0x1) << AST_EVD_PER1_Pos)
#define AST_EVD_MASK                _U_(0x00030301) /**< \brief (AST_EVD) MASK Register */

/* -------- AST_EVM : (AST Offset: 0x50) (R/  32) Event Mask Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t OVF:1;            /*!< bit:      0  Overflow                           */
    uint32_t :7;               /*!< bit:  1.. 7  Reserved                           */
    uint32_t ALARM0:1;         /*!< bit:      8  Alarm 0                            */
    uint32_t ALARM1:1;         /*!< bit:      9  Alarm 1                            */
    uint32_t :6;               /*!< bit: 10..15  Reserved                           */
    uint32_t PER0:1;           /*!< bit:     16  Perioidc 0                         */
    uint32_t PER1:1;           /*!< bit:     17  Periodic 1                         */
    uint32_t :14;              /*!< bit: 18..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} AST_EVM_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AST_EVM_OFFSET              0x50         /**< \brief (AST_EVM offset) Event Mask Register */
#define AST_EVM_RESETVALUE          _U_(0x00000000); /**< \brief (AST_EVM reset_value) Event Mask Register */

#define AST_EVM_OVF_Pos             0            /**< \brief (AST_EVM) Overflow */
#define AST_EVM_OVF                 (_U_(0x1) << AST_EVM_OVF_Pos)
#define AST_EVM_ALARM0_Pos          8            /**< \brief (AST_EVM) Alarm 0 */
#define AST_EVM_ALARM0              (_U_(0x1) << AST_EVM_ALARM0_Pos)
#define AST_EVM_ALARM1_Pos          9            /**< \brief (AST_EVM) Alarm 1 */
#define AST_EVM_ALARM1              (_U_(0x1) << AST_EVM_ALARM1_Pos)
#define AST_EVM_PER0_Pos            16           /**< \brief (AST_EVM) Perioidc 0 */
#define AST_EVM_PER0                (_U_(0x1) << AST_EVM_PER0_Pos)
#define AST_EVM_PER1_Pos            17           /**< \brief (AST_EVM) Periodic 1 */
#define AST_EVM_PER1                (_U_(0x1) << AST_EVM_PER1_Pos)
#define AST_EVM_MASK                _U_(0x00030301) /**< \brief (AST_EVM) MASK Register */

