zephyrproject-rtos/hal_atmel/asf/sam/include/sam4l/component/ast.h
/* -------- AST_CALV : (AST Offset: 0x54) (R/W 32) Calendar Value -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t SEC:6;            /*!< bit:  0.. 5  Second                             */
    uint32_t MIN:6;            /*!< bit:  6..11  Minute                             */
    uint32_t HOUR:5;           /*!< bit: 12..16  Hour                               */
    uint32_t DAY:5;            /*!< bit: 17..21  Day                                */
    uint32_t MONTH:4;          /*!< bit: 22..25  Month                              */
    uint32_t YEAR:6;           /*!< bit: 26..31  Year                               */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} AST_CALV_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AST_CALV_OFFSET             0x54         /**< \brief (AST_CALV offset) Calendar Value */
#define AST_CALV_RESETVALUE         _U_(0x00000000); /**< \brief (AST_CALV reset_value) Calendar Value */

#define AST_CALV_SEC_Pos            0            /**< \brief (AST_CALV) Second */
#define AST_CALV_SEC_Msk            (_U_(0x3F) << AST_CALV_SEC_Pos)
#define AST_CALV_SEC(value)         (AST_CALV_SEC_Msk & ((value) << AST_CALV_SEC_Pos))
#define AST_CALV_MIN_Pos            6            /**< \brief (AST_CALV) Minute */
#define AST_CALV_MIN_Msk            (_U_(0x3F) << AST_CALV_MIN_Pos)
#define AST_CALV_MIN(value)         (AST_CALV_MIN_Msk & ((value) << AST_CALV_MIN_Pos))
#define AST_CALV_HOUR_Pos           12           /**< \brief (AST_CALV) Hour */
#define AST_CALV_HOUR_Msk           (_U_(0x1F) << AST_CALV_HOUR_Pos)
#define AST_CALV_HOUR(value)        (AST_CALV_HOUR_Msk & ((value) << AST_CALV_HOUR_Pos))
#define AST_CALV_DAY_Pos            17           /**< \brief (AST_CALV) Day */
#define AST_CALV_DAY_Msk            (_U_(0x1F) << AST_CALV_DAY_Pos)
#define AST_CALV_DAY(value)         (AST_CALV_DAY_Msk & ((value) << AST_CALV_DAY_Pos))
#define AST_CALV_MONTH_Pos          22           /**< \brief (AST_CALV) Month */
#define AST_CALV_MONTH_Msk          (_U_(0xF) << AST_CALV_MONTH_Pos)
#define AST_CALV_MONTH(value)       (AST_CALV_MONTH_Msk & ((value) << AST_CALV_MONTH_Pos))
#define AST_CALV_YEAR_Pos           26           /**< \brief (AST_CALV) Year */
#define AST_CALV_YEAR_Msk           (_U_(0x3F) << AST_CALV_YEAR_Pos)
#define AST_CALV_YEAR(value)        (AST_CALV_YEAR_Msk & ((value) << AST_CALV_YEAR_Pos))
#define AST_CALV_MASK               _U_(0xFFFFFFFF) /**< \brief (AST_CALV) MASK Register */

/* -------- AST_PARAMETER : (AST Offset: 0xF0) (R/  32) Parameter Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t DT:1;             /*!< bit:      0  Digital Tuner                      */
    uint32_t DTEXPWA:1;        /*!< bit:      1  Digital Tuner Exponent Writeable   */
    uint32_t DTEXPVALUE:5;     /*!< bit:  2.. 6  Digital Tuner Exponent Value       */
    uint32_t :1;               /*!< bit:      7  Reserved                           */
    uint32_t NUMAR:2;          /*!< bit:  8.. 9  Number of alarm comparators        */
    uint32_t :2;               /*!< bit: 10..11  Reserved                           */
    uint32_t NUMPIR:1;         /*!< bit:     12  Number of periodic comparators     */
    uint32_t :1;               /*!< bit:     13  Reserved                           */
    uint32_t PIR0WA:1;         /*!< bit:     14  Periodic Interval 0 Writeable      */
    uint32_t PIR1WA:1;         /*!< bit:     15  Periodic Interval 1 Writeable      */
    uint32_t PER0VALUE:5;      /*!< bit: 16..20  Periodic Interval 0 Value          */
    uint32_t :3;               /*!< bit: 21..23  Reserved                           */
    uint32_t PER1VALUE:5;      /*!< bit: 24..28  Periodic Interval 1 Value          */
    uint32_t :3;               /*!< bit: 29..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} AST_PARAMETER_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AST_PARAMETER_OFFSET        0xF0         /**< \brief (AST_PARAMETER offset) Parameter Register */

#define AST_PARAMETER_DT_Pos        0            /**< \brief (AST_PARAMETER) Digital Tuner */
#define AST_PARAMETER_DT            (_U_(0x1) << AST_PARAMETER_DT_Pos)
#define   AST_PARAMETER_DT_OFF_Val        _U_(0x0)   /**< \brief (AST_PARAMETER) Digital tuner off */
#define   AST_PARAMETER_DT_ON_Val         _U_(0x1)   /**< \brief (AST_PARAMETER) Digital tuner on */
#define AST_PARAMETER_DT_OFF        (AST_PARAMETER_DT_OFF_Val      << AST_PARAMETER_DT_Pos)
#define AST_PARAMETER_DT_ON         (AST_PARAMETER_DT_ON_Val       << AST_PARAMETER_DT_Pos)
#define AST_PARAMETER_DTEXPWA_Pos   1            /**< \brief (AST_PARAMETER) Digital Tuner Exponent Writeable */
#define AST_PARAMETER_DTEXPWA       (_U_(0x1) << AST_PARAMETER_DTEXPWA_Pos)
#define   AST_PARAMETER_DTEXPWA_0_Val     _U_(0x0)   /**< \brief (AST_PARAMETER) Digital tuner exponent is a constant value. Writes to EXP bitfield in DTR will be discarded. */
#define   AST_PARAMETER_DTEXPWA_1_Val     _U_(0x1)   /**< \brief (AST_PARAMETER) Digital tuner exponent is chosen by writing to EXP bitfield in DTR */
#define AST_PARAMETER_DTEXPWA_0     (AST_PARAMETER_DTEXPWA_0_Val   << AST_PARAMETER_DTEXPWA_Pos)
#define AST_PARAMETER_DTEXPWA_1     (AST_PARAMETER_DTEXPWA_1_Val   << AST_PARAMETER_DTEXPWA_Pos)
#define AST_PARAMETER_DTEXPVALUE_Pos 2            /**< \brief (AST_PARAMETER) Digital Tuner Exponent Value */
#define AST_PARAMETER_DTEXPVALUE_Msk (_U_(0x1F) << AST_PARAMETER_DTEXPVALUE_Pos)
#define AST_PARAMETER_DTEXPVALUE(value) (AST_PARAMETER_DTEXPVALUE_Msk & ((value) << AST_PARAMETER_DTEXPVALUE_Pos))
#define AST_PARAMETER_NUMAR_Pos     8            /**< \brief (AST_PARAMETER) Number of alarm comparators */
#define AST_PARAMETER_NUMAR_Msk     (_U_(0x3) << AST_PARAMETER_NUMAR_Pos)
#define AST_PARAMETER_NUMAR(value)  (AST_PARAMETER_NUMAR_Msk & ((value) << AST_PARAMETER_NUMAR_Pos))
#define   AST_PARAMETER_NUMAR_ZERO_Val    _U_(0x0)   /**< \brief (AST_PARAMETER) No alarm comparators */
#define   AST_PARAMETER_NUMAR_ONE_Val     _U_(0x1)   /**< \brief (AST_PARAMETER) One alarm comparator */
#define   AST_PARAMETER_NUMAR_TWO_Val     _U_(0x2)   /**< \brief (AST_PARAMETER) Two alarm comparators */
#define AST_PARAMETER_NUMAR_ZERO    (AST_PARAMETER_NUMAR_ZERO_Val  << AST_PARAMETER_NUMAR_Pos)
#define AST_PARAMETER_NUMAR_ONE     (AST_PARAMETER_NUMAR_ONE_Val   << AST_PARAMETER_NUMAR_Pos)
#define AST_PARAMETER_NUMAR_TWO     (AST_PARAMETER_NUMAR_TWO_Val   << AST_PARAMETER_NUMAR_Pos)
#define AST_PARAMETER_NUMPIR_Pos    12           /**< \brief (AST_PARAMETER) Number of periodic comparators */
#define AST_PARAMETER_NUMPIR        (_U_(0x1) << AST_PARAMETER_NUMPIR_Pos)
#define   AST_PARAMETER_NUMPIR_ONE_Val    _U_(0x0)   /**< \brief (AST_PARAMETER) One periodic comparator */
#define   AST_PARAMETER_NUMPIR_TWO_Val    _U_(0x1)   /**< \brief (AST_PARAMETER) Two periodic comparators */
#define AST_PARAMETER_NUMPIR_ONE    (AST_PARAMETER_NUMPIR_ONE_Val  << AST_PARAMETER_NUMPIR_Pos)
#define AST_PARAMETER_NUMPIR_TWO    (AST_PARAMETER_NUMPIR_TWO_Val  << AST_PARAMETER_NUMPIR_Pos)
#define AST_PARAMETER_PIR0WA_Pos    14           /**< \brief (AST_PARAMETER) Periodic Interval 0 Writeable */
#define AST_PARAMETER_PIR0WA        (_U_(0x1) << AST_PARAMETER_PIR0WA_Pos)
#define   AST_PARAMETER_PIR0WA_0_Val      _U_(0x0)   /**< \brief (AST_PARAMETER) Periodic alarm prescaler 0 tapping is a constant value. Writes to INSEL bitfield in PIR0 will be discarded. */
#define   AST_PARAMETER_PIR0WA_1_Val      _U_(0x1)   /**< \brief (AST_PARAMETER) Periodic alarm prescaler 0 tapping is chosen by writing to INSEL bitfield in PIR0 */
#define AST_PARAMETER_PIR0WA_0      (AST_PARAMETER_PIR0WA_0_Val    << AST_PARAMETER_PIR0WA_Pos)
#define AST_PARAMETER_PIR0WA_1      (AST_PARAMETER_PIR0WA_1_Val    << AST_PARAMETER_PIR0WA_Pos)
#define AST_PARAMETER_PIR1WA_Pos    15           /**< \brief (AST_PARAMETER) Periodic Interval 1 Writeable */
#define AST_PARAMETER_PIR1WA        (_U_(0x1) << AST_PARAMETER_PIR1WA_Pos)
#define   AST_PARAMETER_PIR1WA_0_Val      _U_(0x0)   /**< \brief (AST_PARAMETER) Writes to PIR1 will be discarded */
#define   AST_PARAMETER_PIR1WA_1_Val      _U_(0x1)   /**< \brief (AST_PARAMETER) PIR1 can be written */
#define AST_PARAMETER_PIR1WA_0      (AST_PARAMETER_PIR1WA_0_Val    << AST_PARAMETER_PIR1WA_Pos)
#define AST_PARAMETER_PIR1WA_1      (AST_PARAMETER_PIR1WA_1_Val    << AST_PARAMETER_PIR1WA_Pos)
#define AST_PARAMETER_PER0VALUE_Pos 16           /**< \brief (AST_PARAMETER) Periodic Interval 0 Value */
#define AST_PARAMETER_PER0VALUE_Msk (_U_(0x1F) << AST_PARAMETER_PER0VALUE_Pos)
#define AST_PARAMETER_PER0VALUE(value) (AST_PARAMETER_PER0VALUE_Msk & ((value) << AST_PARAMETER_PER0VALUE_Pos))
#define AST_PARAMETER_PER1VALUE_Pos 24           /**< \brief (AST_PARAMETER) Periodic Interval 1 Value */
#define AST_PARAMETER_PER1VALUE_Msk (_U_(0x1F) << AST_PARAMETER_PER1VALUE_Pos)
#define AST_PARAMETER_PER1VALUE(value) (AST_PARAMETER_PER1VALUE_Msk & ((value) << AST_PARAMETER_PER1VALUE_Pos))
#define AST_PARAMETER_MASK          _U_(0x1F1FD37F) /**< \brief (AST_PARAMETER) MASK Register */

/* -------- AST_VERSION : (AST Offset: 0xFC) (R/  32) Version Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t VERSION:12;       /*!< bit:  0..11  Version Number                     */
    uint32_t :4;               /*!< bit: 12..15  Reserved                           */
    uint32_t VARIANT:4;        /*!< bit: 16..19  Variant Number                     */
    uint32_t :12;              /*!< bit: 20..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} AST_VERSION_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AST_VERSION_OFFSET          0xFC         /**< \brief (AST_VERSION offset) Version Register */
#define AST_VERSION_RESETVALUE      _U_(0x00000311); /**< \brief (AST_VERSION reset_value) Version Register */

